w9d1/first_routes/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 1]]
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."viewer_id" = $1 AND "artwork_shares"."viewer_id" = $2  [["viewer_id", 1], ["viewer_id", 1]]
SELECT "artworks".* FROM "artworks"
---
    def index
        if params.has_key?(:user_id)
            artworks = Artwork.where(artist_id: params[:user_id])
            # user = User.find(params[:user_id])
            # viewed_artworks = user.shares
            viewed_artworks = ArtworkShare.where(viewer_id: params[:user_id])
        else
            artworks = Artwork.all