w9d1/first_routes/app/controllers/comments_controller.rb

    def index
        if params.has_key?(:artwork_id)
            comments = Comment.where(artwork_id: params[:artwork_id])
            render json: comments
        elsif params.has_key?(:user_id)
            comments = Comment.where(user_id: params[:user_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]

    def create
        comment = Comment.new(comment_params)

        if comment.save
---
INSERT INTO "comments" ("body", "user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Nice artwork!"], ["user_id", 2], ["artwork_id", 1], ["created_at", "2020-01-22 23:59:12.774939"], ["updated_at", "2020-01-22 23:59:12.774939"]]