w9d1/first_routes/app/controllers/users_controller.rb

    def index
        if params.has_key?(:username)
            user = User.find_by(username: params[:username])
            render json: user
        else
            users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Philippe"], ["LIMIT", 1]]
SELECT "users".* FROM "users"