w9d3/ninety-nine/app/controllers/cats_controller.rb

  def index
    @cat = Cat.all
---
SELECT "cats".* FROM "cats"

  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "color" = $2, "name" = $3, "sex" = $4, "description" = $5, "updated_at" = $6 WHERE "cats"."id" = $7  [["birth_date", "1988-08-12"], ["color", "black"], ["name", "Jolly"], ["sex", "M"], ["description", "Loyal cat\r\n    \r\n    "], ["updated_at", "2020-01-26 20:59:02.585588"], ["id", 6]]