w10d1/music_app/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "h6COT05Yr2Gz1C15fRKdFQ"], ["updated_at", "2020-01-27 23:43:22.265902"], ["id", 4]]
---
  def create
    @user = User.find_by(id: params[:id])

    if @user.save